// 1. Big O Notation რა არის?
// Big O Notation არის მათემატიკური გზა, რომელიც აღწერს ალგორითმის დროით (ან მეხსიერების) სირთულეს იმის მიხედვით, თუ როგორ იზრდება ალგორითმის შესრულების დრო შეყვანის მონაცემების ზომის (n) ზრდასთან ერთად.
// მარტივად რომ ვთქვათ — ის გვიჩვენებს, რამდენად კარგად იქცევა ალგორითმი დიდი მონაცემებისას. გამოიყენება იმისთვის, რომ შევადაროთ სხვადასხვა ალგორითმები და ავარჩიოთ ყველაზე ეფექტური, განსაკუთრებით დიდი n-ის შემთხვევაში.

// 2. დალაგება

// O(1) — Constant time (ყველაზე სწრაფი)
// O(log n)
// O(n)
// O(n log n)
// O(n²) — ყველაზე ნელი ამ სიაში



// 3.
for(let i = 0; i < n; i++) {
    console.log(i);
}
// ეს არის o(n)

for(let i = 0; i < n; i++) {
    for(let j = 0; j < n; j++) {
        console.log(i, j);
    }
}
// ეს არის O(n²)